office/android开发技巧/android开发技巧.org
#+TITLE:    android开发技巧
#+AUTHOR:   



* 开场白

** 题外话

 1. 一般有经验的开发人员，都知道不论什么开发语言，什么开发框架，里面有许多一层不变的代码。要用的时候，就是拷贝过来就好了(或者网上搜索一下)。这些属于某一平台下的死知识。
 1. 一般学android开发时，网上下载的视频，都是按部就班，一步一步地讲解。里面有大量的死知识。这些知识在开发过程里，只要知道怎样创建类实例，怎样调方法传参数，是怎样实现的这种功能的就可以了。对于有经验的开发人员，已经积累其它平台的线程，布局的开发经验了。在开发android时这些只要能看懂，把别人的现成的代码拷贝过来，添点自己具体的内容，就可以了。
 1. 那怎样快速熟悉android的精华。用android框架实现需要的业务功能呢?一般是从adapter开始。android在module和view之间的衔接靠的就是adapter，适配器。而且适配器非常灵活。还有第三方把adapter开发成了一些优秀的简洁的开源框架，像greendroid。通过了解adapter的过程，可以一步一步熟悉android的一般开发步骤和基本框架结构。


** 参考开源android项目
*** android目前开发环境介绍
 1. android一般属于小型项目，一般服务器类的官方网站开发了andrid客户端，这些开发人员比较喜欢把这些android项目开源化，这就为平时开发andorid的开发人员提供了借鉴的基础，通过源代码，可以了解到一流的代码的组织方式。 
*** 收集的开源项目
     [[http://git.oschina.net/oschina/android-app][OSCHINA 的 Android 客户端源码，可在 Google Play 或者国内几个应用市场上搜索“开源中国”来安装此app]]

*** 收集的开源项目介绍(blog)

     [[http://www.csdn.net/article/2013-05-03/2815127-Android-open-source-projects][直接拿来用！最火的Android开源项目]]

     [[http://blog.csdn.net/ithomer/article/details/8882236][GitHub Android 开源项目汇总]]

     [[http://www.cnblogs.com/TerryBlog/archive/2011/04/18/2019907.html][众多Android 开源项目推荐，给力工作给力学习]]
     

* 开发环境配置
** android开发平台
*** android sdk
 
     [[smb://192.168.0.238/新马共享/工具软件/android手机/开发环境/adt-bundle-windows-x86.zip][android SDK]]

     [[smb://192.168.0.238/新马共享/工具软件/android手机/开发环境/IntelliJ IDEA 12.1.3.zip][intellij idea 12 手机开发 IDE]]

     [[http://www.zhenhua.org/article.asp?id=736][Intellij IDEA 12 Crack/Keymaker]]

*** intellij idea 使用

    1. 网站blog
       
       [[http://www.oschina.net/news/26929/why-intellij-is-better-than-eclipse][为何 IntelliJ IDEA 比 Eclipse 更好]]

       [[http://my.oschina.net/simaben/blog/116056][Intellij IDEA开发第一个android应用教程]]

*** android 项目构建工具

    1. ant,maven,gradle


* 第一讲: adapter
 1. 通过适配器的深入了解的同时，可以接触到android开发方面的基础知识(activity之间的切换，android是怎样触发事件响应，activity的生命周期，android的布局框架，每一屏幕的activity是怎样把button，image这些view显示到正确的位置,activity的xml布局的加载)   

** 参考网站:
    [[http://www.jizhuomi.com/android/game/322.html][自定义ListView通用适配器（BaseAdapter）之全方位详解]]

** 推荐pdf
   [[http://wenku.baidu.com/view/15afbcd4b9f3f90f76c61bb5][深入浅出 Google Android(PDF格式高清中文版)]] 

* 第二讲:合理组织页面(activity)元素
 1. android的商业开发过程，随时可能用户会提出页面某一块不满意。怎样在不影响整个项目的基础上，把用户提出的那一块修改好。这就需要页面元素的组件化开发。
 1. 开发之前，把显示的整个页面切分成相对独立的各个组件，这样可以达到组件复用的功能，又可以针对用户不满意的这个组件在不影响其它代码的条件下进行修改。
 1. 项目组开发之前，把页面组件化后，可以分配给不同的开发员工单独开发，这样合作分工比较明确。之后利用适配器把这些组件集成到整个页面上。

** 使用第三方框架Greendroid
*** 开源项目
    [[https://github.com/cyrilmottier/GreenDroid][Greendroid]]

*** 推荐BLOG
    [[http://jiangli.easymorse.com/?p=1435][Android使用GreenDroid]]

    [[http://www.acwind.net/blog/?p=1297][Android 第三方 UI 库 GreenDroid 使用方法]]

    [[http://www.zhuzhusoft.com/article.php?id=57][开源安卓UI项目GreenDroid的使用方法]]

** include，merge (android官方的组件化)
*** xml布局介绍
   
    [[http://huangbo-2020.iteye.com/blog/1008974][Android layout xml总结]]

    [[http://book.51cto.com/art/201206/343939.htm][使用XML布局文件控制UI界面]]

*** include布局
 1. include布局可以把activity页面组织清晰，开发网页的人员在组织html页面时，把head，foot单独放到一个html页面里，android的include起到网页的这种作用。
     
**** 推荐blog

     [[http://www.ataaw.com/develop/277.html][Android布局整合include界面控件]]

     [[http://blog.csdn.net/mzl626/article/details/5978297][Android layout之优化：使用include和merge 标签]]

     [[http://androidbiancheng.blogspot.com/2011/01/includeui.html][使用include重用UI組件]]


**** 推荐项目

     [[http://git.oschina.net/oschina/android-app][OSCHINA 的 Android 客户端源码，可在 Google Play 或者国内几个应用市场上搜索“开源中国”来安装此app]]

 1. 这款项目使用了大量的include，把复杂的页面清晰地表达清晰了。

** greendroid (第三方的组件化)












    




    







