office/android开发技巧/android开发技巧.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>android开发技巧</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="android开发技巧"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-14T03:59+0100"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">android开发技巧</h1>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 开场白</a>
<ul>
<li><a href="#sec-1-1">1.1 题外话</a></li>
<li><a href="#sec-1-2">1.2 参考开源android项目</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 android目前开发环境介绍</a></li>
<li><a href="#sec-1-2-2">1.2.2 收集的开源项目</a></li>
<li><a href="#sec-1-2-3">1.2.3 收集的开源项目介绍blog</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 开发环境配置</a>
<ul>
<li><a href="#sec-2-1">2.1 android开发平台</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 android sdk</a></li>
<li><a href="#sec-2-1-2">2.1.2 intellij idea 使用</a></li>
<li><a href="#sec-2-1-3">2.1.3 android 项目构建工具</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 第一讲: adapter</a>
<ul>
<li><a href="#sec-3-1">3.1 参考网站:</a></li>
<li><a href="#sec-3-2">3.2 推荐pdf</a></li>
</ul>
</li>
<li><a href="#sec-4">4 第二讲:合理组织页面(activity)元素</a>
<ul>
<li><a href="#sec-4-1">4.1 使用第三方框架Greendroid</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 开源项目</a></li>
<li><a href="#sec-4-1-2">4.1.2 推荐BLOG</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2 include，merge (android官方的组件化)</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1 xml布局介绍</a></li>
<li><a href="#sec-4-2-2">4.2.2 include布局</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3 greendroid (第三方的组件化)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 开场白</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 题外话</h3>
<div class="outline-text-3" id="text-1-1">


<ol>
<li>一般有经验的开发人员，都知道不论什么开发语言，什么开发框架，里面有许多一层不变的代码。要用的时候，就是拷贝过来就好了(或者网上搜索一下)。这些属于某一平台下的死知识。
</li>
<li>一般学android开发时，网上下载的视频，都是按部就班，一步一步地讲解。里面有大量的死知识。这些知识在开发过程里，只要知道怎样创建类实例，怎样调方法传参数，是怎样实现的这种功能的就可以了。对于有经验的开发人员，已经积累其它平台的线程，布局的开发经验了。在开发android时这些只要能看懂，把别人的现成的代码拷贝过来，添点自己具体的内容，就可以了。
</li>
<li>那怎样快速熟悉android的精华。用android框架实现需要的业务功能呢?一般是从adapter开始。android在module和view之间的衔接靠的就是adapter，适配器。而且适配器非常灵活。还有第三方把adapter开发成了一些优秀的简洁的开源框架，像greendroid。通过了解adapter的过程，可以一步一步熟悉android的一般开发步骤和基本框架结构。
</li>
</ol>



</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 参考开源android项目</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> android目前开发环境介绍</h4>
<div class="outline-text-4" id="text-1-2-1">

<ol>
<li>android一般属于小型项目，一般服务器类的官方网站开发了andrid客户端，这些开发人员比较喜欢把这些android项目开源化，这就为平时开发andorid的开发人员提供了借鉴的基础，通过源代码，可以了解到一流的代码的组织方式。 
</li>
</ol>

</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 收集的开源项目</h4>
<div class="outline-text-4" id="text-1-2-2">

<p>     <a href="http://git.oschina.net/oschina/android-app">OSCHINA 的 Android 客户端源码，可在 Google Play 或者国内几个应用市场上搜索“开源中国”来安装此app</a>
</p>
</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 收集的开源项目介绍blog</h4>
<div class="outline-text-4" id="text-1-2-3">

<p>     <a href="http://www.csdn.net/article/2013-05-03/2815127-Android-open-source-projects">直接拿来用！最火的Android开源项目</a>
</p>
<p>
     <a href="http://blog.csdn.net/ithomer/article/details/8882236">GitHub Android 开源项目汇总</a>
</p>
<p>
     <a href="http://www.cnblogs.com/TerryBlog/archive/2011/04/18/2019907.html">众多Android 开源项目推荐，给力工作给力学习</a>
</p>

</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 开发环境配置</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> android开发平台</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> android sdk</h4>
<div class="outline-text-4" id="text-2-1-1">


<p> 
     <a href="#smb-192.168.0.238-android-adt-bundle-windows-x86.zip">android SDK</a>
</p>
<p>
     <a href="#smb-192.168.0.238-android-IntelliJ-IDEA-12.1.3.zip">intellij idea 12 手机开发 IDE</a>
</p>
<p>
     <a href="http://www.zhenhua.org/article.asp?id=736">Intellij IDEA 12 Crack/Keymaker</a>
</p>
</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> intellij idea 使用</h4>
<div class="outline-text-4" id="text-2-1-2">


<ol>
<li>网站blog

<p>       
       <a href="http://www.oschina.net/news/26929/why-intellij-is-better-than-eclipse">为何 IntelliJ IDEA 比 Eclipse 更好</a>
</p>
<p>
       <a href="http://my.oschina.net/simaben/blog/116056">Intellij IDEA开发第一个android应用教程</a>
</p></li>
</ol>


</div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> android 项目构建工具</h4>
<div class="outline-text-4" id="text-2-1-3">


<ol>
<li>ant,maven,gradle
</li>
</ol>



</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 第一讲: adapter</h2>
<div class="outline-text-2" id="text-3">

<ol>
<li>通过适配器的深入了解的同时，可以接触到android开发方面的基础知识(activity之间的切换，android是怎样触发事件响应，activity的生命周期，android的布局框架，每一屏幕的activity是怎样把button，image这些view显示到正确的位置,activity的xml布局的加载)   
</li>
</ol>



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 参考网站:</h3>
<div class="outline-text-3" id="text-3-1">

<p>    <a href="http://www.jizhuomi.com/android/game/322.html">自定义ListView通用适配器（BaseAdapter）之全方位详解</a>
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 推荐pdf</h3>
<div class="outline-text-3" id="text-3-2">

<p>   <a href="http://wenku.baidu.com/view/15afbcd4b9f3f90f76c61bb5">深入浅出 Google Android(PDF格式高清中文版)</a> 
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 第二讲:合理组织页面(activity)元素</h2>
<div class="outline-text-2" id="text-4">

<ol>
<li>android的商业开发过程，随时可能用户会提出页面某一块不满意。怎样在不影响整个项目的基础上，把用户提出的那一块修改好。这就需要页面元素的组件化开发。
</li>
<li>开发之前，把显示的整个页面切分成相对独立的各个组件，这样可以达到组件复用的功能，又可以针对用户不满意的这个组件在不影响其它代码的条件下进行修改。
</li>
<li>项目组开发之前，把页面组件化后，可以分配给不同的开发员工单独开发，这样合作分工比较明确。之后利用适配器把这些组件集成到整个页面上。
</li>
</ol>



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 使用第三方框架Greendroid</h3>
<div class="outline-text-3" id="text-4-1">


</div>

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> 开源项目</h4>
<div class="outline-text-4" id="text-4-1-1">

<p>    <a href="https://github.com/cyrilmottier/GreenDroid">Greendroid</a>
</p>
</div>

</div>

<div id="outline-container-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> 推荐BLOG</h4>
<div class="outline-text-4" id="text-4-1-2">

<p>    <a href="http://jiangli.easymorse.com/?p=1435">Android使用GreenDroid</a>
</p>
<p>
    <a href="http://www.acwind.net/blog/?p=1297">Android 第三方 UI 库 GreenDroid 使用方法</a>
</p>
<p>
    <a href="http://www.zhuzhusoft.com/article.php?id=57">开源安卓UI项目GreenDroid的使用方法</a>
</p>
</div>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> include，merge (android官方的组件化)</h3>
<div class="outline-text-3" id="text-4-2">


</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> xml布局介绍</h4>
<div class="outline-text-4" id="text-4-2-1">


<p>   
    <a href="http://huangbo-2020.iteye.com/blog/1008974">Android layout xml总结</a>
</p>
<p>
    <a href="http://book.51cto.com/art/201206/343939.htm">使用XML布局文件控制UI界面</a>
</p>
</div>

</div>

<div id="outline-container-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> include布局</h4>
<div class="outline-text-4" id="text-4-2-2">

<ol>
<li>include布局可以把activity页面组织清晰，开发网页的人员在组织html页面时，把head，foot单独放到一个html页面里，android的include起到网页的这种作用。
</li>
</ol>


<ul>
<li id="sec-4-2-2-1">推荐blog<br/>

<p>
     <a href="http://www.ataaw.com/develop/277.html">Android布局整合include界面控件</a>
</p>
<p>
     <a href="http://blog.csdn.net/mzl626/article/details/5978297">Android layout之优化：使用include和merge 标签</a>
</p>
<p>
     <a href="http://androidbiancheng.blogspot.com/2011/01/includeui.html">使用include重用UI組件</a>
</p>

</li>
</ul>
<ul>
<li id="sec-4-2-2-2">推荐项目<br/>

<p>
     <a href="http://git.oschina.net/oschina/android-app">OSCHINA 的 Android 客户端源码，可在 Google Play 或者国内几个应用市场上搜索“开源中国”来安装此app</a>
</p>
<ol>
<li>这款项目使用了大量的include，把复杂的页面清晰地表达清晰了。
</li>
</ol>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> greendroid (第三方的组件化)</h3>
<div class="outline-text-3" id="text-4-3">


























</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-08-14T03:59+0100</p>
<p class="author">Author: </p>
<p class="creator"><a href="http://orgmode.org">Org</a> version N/A-fixup with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
